sirfonzie/esp32c3-mtk3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Route the primary console through USB-Serial-JTAG (USB-C on the C3-Mini).
# esp_rom_output_{tx,rx}_one_char route through USB-Serial-JTAG — no external
# USB-UART adapter required.
# Feature-specific additions live in sdkconfig.defaults.wifi / .ble / .wifi_ble.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# The port cannot arm the Task-WDT: IDF initializes it in
# esp_startup_start_app() (wrapped away) and feeds it from the FreeRTOS idle
# task (which does not exist here).  State that honestly instead of building
# with a watchdog config that is silently inert.  The INT-WDT *is* armed and
# fed by the kernel (see kernel/sysdepend/.../interrupt.c).
CONFIG_ESP_TASK_WDT_EN=n
